{
	"landing": {
		"firstName": "Caleb",
		"lastName": " Getahun",
		"phoneNumber": "(301) 828-0305",
		"bio": "I am a junior at Duke University pursuing a double major in Computer Science and Mathematics. I have interests in iOS app development, web development, and machine learning. The application of these fields to computational neuroscience and education are what I'm currently involved in!",
    "email": "caleb.getahun@duke.edu",
    "linkedin": "https://linkedin.com/in/calebgetahun",
		"github": "https://github.com/calebgetahun"
	},
	"experience": [
		{
				"position": "Software Engineer Intern",
				"organization": "Duke Office of Information Technology",
				"aboutWork": "Developed and deployed an iOS augmented reality app with 5 other developers for the Duke Athletics Office to engage the 1000+ visitors annually that come to learn more about the Duke Basketball Team.",
				"fromDate": "May 2020",
				"toDate": "August 2020"
		},
		{
			"position": "R&D Machine Learning Assistant",
			"organization": "Duke Neurobiology: NeuroDisney Lab",
			"aboutWork": "In the process of training and testing unsupervised machine learning models using a variety of statistical analysis techniques (Principal component analysis (PCA), Non-negative matrix factorization, Latent Dirichlet Allocation, K-means clustering, etc.) to aid in accurate cell counting and computation. I have also looked at and written MATLAB scripts in conjunction with our iterations on PLDAPS, a toolbox used to study the visual systems of awake, behaving primates by aiding in data collection and analysis.",
			"fromDate": "September 2019",
			"toDate": "Present"
		},
		{
			"position": "Peer Tutor in Data Structures & Algorithms in Java, Linear Algebra and Differential Equations",
			"organization": "Duke Academic Resource Center",
			"aboutWork": "Currently tutoring students in CS 201: Data Structures and Algorithms in Java with a focus on basic and advanced data structures, object oriented programming, and algorithmic problem solving techniques. I've previously tutored in Linear Algebra and Differential Equations aiding in in topics relating to matrix operations, linear transformations, and solving differential equations.",
			"fromDate": "January 2020",
			"toDate": "Present"
        }
	],
	"education": [{
			"university": "Duke University",
			"degree": "B.S. in Computer Science, B.A. in Mathematics, David M. Rubenstein Scholar",
			"fromDate": "August 2018",
			"toDate": "Present"
		}
	],
	"extracurriculars":[{
		"clubwithpos": "Duke Ethiopian/Eritrean Student Transnational Association (DESTA), current Co-President, former VP and Freshman Liason",
		"aboutclub": "We work to foster appreciation for Ethiopian and Eritrean culture within the Duke Community through programing centered around food, dance, and history"
	},
	{
		"clubwithpos": "HackDuke, Planning Committee – Outreach Team",
		"aboutclub": "Planning and organizing of the nation’s premier hackathon for tech and social good, HackDuke. The annual Code for Good hackathon strives to increase awareness for pressing social issues through a hackathon for students all over the country. This includes contacting potential speakers, publicizing the hackathon on Duke’s campus and beyond, and partnering with the largest tech companies (Google, Citadel, Facebook, etc.) as sponsors."
	},
	{
		"clubwithpos": "Duke Cubing Club, Vice President of Education and Organization",
		"aboutclub": "The Duke Cubing Club strives to provide a space for Rubik's cube enthusiasts as well as newcomers to learn more about basic as well as advanced techniques in solving the Rubik's cube. We hold Duke-wide as well as official WCA competitions throughout the Durham, North Carolina area."
	},
	{
		"clubwithpos": "National Society of Black Engineers (NSBE), Member",
		"aboutclub": "NSBE Mission Statement: To increase the number of culturally responsible Black Engineers who excel academically, succeed professionally and positively impact the community. Participate in workshops centered on career readiness and volunteering in the local Durham community."
	},
	{
		"clubwithpos": "The Chanticleer: Duke’s Yearbook, Photographer",
		"aboutclub": "Shoot events happening on campus, such as athletic competitions or student performances. These pictures are to be used for the student yearbook."
	}

	],
	"skills": [{
			"proficient": "Proficient: Python, Java, Swift, Matlab, Git"
		},
		{
			"familiar": "Familiar: C, Javascript, HTML/CSS, Flask, Pytorch"
		}
		
	],
	"interests": {
        "paragraphOne": "When not immersed in the tech world, I enjoy playing and watching basketball with friends. Go Blue Devils!",
		"paragraphTwo": "I also have fun solving and competing in Rubik's Cube competitions. In fact, my best time solving the 3x3 is 15 seconds.",
		"paragraphThree": "I also enjoy folding origami shapes, animals, and more."
	},
	"projects": [{
			"title":"Media Bias Detection using Natural Language Processing (NLP)",
			"projectDetails": "Utilized Natural Language Processing to determine bias in popular news sources (Buzzfeed, Fox News). Created 3 Word2vec language models (leftist, rightist, centrist) to analyze word associations as well as 2 small scale Finetune GPT-2 models to generate text based on the sentiments of these sources.",
			"techused": "Utilized: Python, Pytorch, Word2vec Gensim library, GPT-2 library, Google Colab, Pandas"
		},
		{
			"title": "Augmented Reality iOS Basketball Game",
			"projectDetails":"Created AR Basketball Game that enables user to play live basketball with features to change the location of the hoop and customize their set up.",
			"techused": "Utilized: Swift, Xcode, ARKit, SceneKit"
		},
		{
			"title": "A* Path Finding Algorithm Visualization using Pygame",
			"projectDetails": "Implemented the A* graph traveral search algorithm to allow the user to view an implementation of the shortest path between two nodes. I later implemented a Pygame GUI to engage the viewer with a visual.",
			"techused": "Utilized: Python, Pygame, Graph Traversals, Shortest Path Algorithms"
		},
		{	"title":"iOS NoteSharing App",
			"projectDetails": "Developed an iOS application using Swift to enable users to share notes from a variety of classes. This was inspired from struggling to get the classes wanted during registration period and missing out on the content.",
			"techused": "Utilized: Swift, Firebase iOS SDK for Database and Authentication, Cloud storage, Mobile App Development"

		}
        
	]
}